* >Natural Source Header 000000
* :Mode S
* :CP windows-1252
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 #TL-CARGO (A030)
1 #TL-MATRICULA (A08)
1 #TL-NOME (A039)
1 #TL-ANIV (D)
1 #MENSAGEM (A70)
END-DEFINE
MOVE 'JOHN' TO #TL-NOME
CALLNAT 'SUBPGM1'   #TL-CARGO
  #TL-MATRICULA
  #TL-NOME
  #TL-ANIV
  #MENSAGEM
  WRITE #TL-MATRICULA #TL-NOME
  END



