* >Natural Source Header 000000
* :Mode S
* :CP windows-1252
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 EMPLOYEE VIEW EMPLOYEES-DB208
  2 PERSONNEL-ID   (A8)
  2 NAME           (A20)
  2 FIRST-NAME     (A20)
  2 DEPT           (A6)
END-DEFINE
*
FIND EMPLOYEE WITH
EMPLOYEE.DEPT EQ 'ADEMO9'
*
 IF NO RECORD FOUND
  WRITE 'NO ETRY FOUND FOR DEPARTMENT ADEMOX'
 END-NOREC
DISPLAY PERSONNEL-ID DEPT NAME FIRST-NAME
END-FIND
END
