* >Natural Source Header 000000
* :Mode R
* :CP windows-1252
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
01 #VAR1      (A15)
01 #RES1      (A40)
END-DEFINE
*
INPUT *PROGRAM "INFORME PARAMETRO:" #VAR1
CALLNAT 'subp1' #VAR1 #RES1
DISPLAY #RES1
END
