* >Natural Source Header 000000
* :Mode R
* :CP windows-1252
* :LineIncrement 10
* <Natural Source Header
WRITE '=' *USER
WRITE '=' *INIT-USER
END
