* >Natural Source Header 000000
* :Mode S
* :CP windows-1252
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 VEH VIEW VEHICLES-DB204
  2 REG-NUM
  2 PERSONNEL-ID
  2 MAKE
  2 MODEL
  2 YEAR
*
1 #FROM   (A08) INIT <'FORD'>
1 #END    (A08) INIT <'ZZZZ'>
END-DEFINE
*
READ (20) VEH BY MAKE STARTING FROM #FROM ENDING AT #END
  DISPLAY REG-NUM MAKE MODEL YEAR PERSONNEL-ID
END-READ
END
