DEFINE DATA GLOBAL
/* >Natural Source Header 000000
/* :Mode S
/* :CP windows-1252
/* <Natural Source Header
*  /** New Global Data Area GDEMOBOR.
*  /**
*  /** :author brtdo
*  /* TODO Enter your data definition      s here
1 +SISTEMA (A10)
  INIT
  <'SAG'>
END-DEFINE
